tap "homebrew/services"
tap "koekeishiya/formulae"
tap "supabase/tap"
brew "cowsay"
brew "deno"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "gitui"
brew "gnupg"
brew "lazygit"
brew "libuv"
brew "luajit"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk"
brew "pmd"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby"
brew "sl"
brew "stow"
brew "stylua"
brew "tmux"
brew "watchman"
brew "supabase/tap/supabase"
cask "iterm2"
cask "nvs"
cask "obs"
cask "openscad"
cask "visual-studio-code"
cask "warp"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "joaopaulocmarra.inline-blame-mini"
vscode "joshbolduc.commitlint"
vscode "kamikillerto.vscode-colorize"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "supabase.vscode-supabase-extension"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
